dot-config/emacs/README.org
#+TITLE: GNU Emacs Config
#+AUTHOR: Martin Chaperot
#+PROPERTY: header-args :tangle init.el
#+STARTUP: overview

* Table of Contents :toc:
- [[#usage][Usage]]
- [[#package-manager][Package Manager]]
- [[#keyboard][Keyboard]]
  - [[#evil-mode][EVIL Mode]]
  - [[#escape-binding][escape binding]]
  - [[#return-is-newline-no-indent][return is newline (no indent)]]
  - [[#which-key][Which Key]]
- [[#ui-tweaks][UI Tweaks]]
  - [[#language][Language]]
  - [[#theme][Theme]]
  - [[#modeline][Modeline]]
  - [[#font][Font]]
    - [[#ligatures][Ligatures]]
  - [[#icons][Icons]]
    - [[#nerd-fonts-for-emacs][Nerd Fonts for Emacs]]
    - [[#all-the-icons][All the icons]]
  - [[#builtin-ui-tweaks][Builtin UI Tweaks]]
  - [[#transparency][Transparency]]
  - [[#rainbow-delimiters][Rainbow Delimiters]]
  - [[#rainbow-mode][Rainbow Mode]]
- [[#minibuffer-improvements][Minibuffer Improvements]]
  - [[#vertico][Vertico]]
  - [[#orderless-completition][Orderless Completition]]
  - [[#save-history-across-emacs-sessions][Save history across emacs sessions]]
  - [[#marginalia][Marginalia]]
- [[#packages][Packages]]
  - [[#projectile][Projectile]]
    - [[#ripgrep-support][Ripgrep support]]
  - [[#dashboard][Dashboard]]
  - [[#org-mode][Org Mode]]
    - [[#org-superstar][Org Superstar]]
    - [[#latex-formating][Latex Formating]]
    - [[#speedy-latex][Speedy Latex]]
    - [[#auto-image-rendering][Auto image rendering]]
    - [[#auto-tangleing][Auto Tangleing]]
    - [[#toc-org][TOC Org]]
  - [[#treemacs][Treemacs]]
  - [[#evil-anzu][Evil Anzu]]
  - [[#flycheck][Flycheck]]
  - [[#company-mode][Company Mode]]
- [[#language-support][Language Support]]
  - [[#tree-sitter-syntax-highlighting][Tree Sitter (Syntax Highlighting)]]
    - [[#ensure-treesitter][Ensure treesitter]]
    - [[#enable-modes][Enable modes]]
  - [[#markdown][Markdown]]
  - [[#lsp-mode][LSP Mode]]
  - [[#lsp-ui][LSP UI]]
  - [[#web][Web]]
  - [[#vuetsjs][Vue/TS/JS]]
  - [[#python][Python]]
    - [[#pyright][Pyright]]
    - [[#pyenv-mode][Pyenv Mode]]
    - [[#on-save][On save]]
  - [[#java][Java]]
  - [[#haskell][Haskell]]
  - [[#go][Go]]
    - [[#on-save-1][On save]]
- [[#quality-of-life][Quality of Life]]
  - [[#move-backup-files][Move Backup Files]]
  - [[#move-custom-file][Move Custom File]]
  - [[#enable-folding][Enable Folding]]
  - [[#auto-revert][Auto Revert]]
  - [[#spaces-over-tabs][Spaces over tabs]]
  - [[#stuff-on-save][Stuff on save]]

* Usage
I use evil mode and evil mode collections. This means that vim like bindings apply almost everywhere.
Other than that, i've set some custom bindings for myself. I also have which-key to help with discovery.

I've also defined bindings to make certain interfaces more vim-like (i.e. ivy minibuffer) but those are defined in the corresponding use-package.
* Package Manager
Configure the Elpaca. We also want to use ~use-package~.
#+begin_src emacs-lisp
(defvar elpaca-installer-version 0.7)
(defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
(defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
(defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
(defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                              :ref nil :depth 1
                              :files (:defaults "elpaca-test.el" (:exclude "extensions"))
                              :build (:not elpaca--activate-package)))
(let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
       (build (expand-file-name "elpaca/" elpaca-builds-directory))
       (order (cdr elpaca-order))
       (default-directory repo))
  (add-to-list 'load-path (if (file-exists-p build) build repo))
  (unless (file-exists-p repo)
    (make-directory repo t)
    (when (< emacs-major-version 28) (require 'subr-x))
    (condition-case-unless-debug err
        (if-let ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                 ((zerop (apply #'call-process `("git" nil ,buffer t "clone"
                                                 ,@(when-let ((depth (plist-get order :depth)))
                                                     (list (format "--depth=%d" depth) "--no-single-branch"))
                                                 ,(plist-get order :repo) ,repo))))
                 ((zerop (call-process "git" nil buffer t "checkout"
                                       (or (plist-get order :ref) "--"))))
                 (emacs (concat invocation-directory invocation-name))
                 ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                       "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                 ((require 'elpaca))
                 ((elpaca-generate-autoloads "elpaca" repo)))
            (progn (message "%s" (buffer-string)) (kill-buffer buffer))
          (error "%s" (with-current-buffer buffer (buffer-string))))
      ((error) (warn "%s" err) (delete-directory repo 'recursive))))
  (unless (require 'elpaca-autoloads nil t)
    (require 'elpaca)
    (elpaca-generate-autoloads "elpaca" repo)
    (load "./elpaca-autoloads")))
(add-hook 'after-init-hook #'elpaca-process-queues)
(elpaca `(,@elpaca-order))

;; Install use-package support
(elpaca elpaca-use-package
  ;; Enable use-package :ensure support for Elpaca.
  (elpaca-use-package-mode))

;; Block until current queue processed.
(elpaca-wait)
#+end_src
* Keyboard
** EVIL Mode
#+begin_src emacs-lisp
(use-package evil
  :after which-key
  :ensure t
  :custom
  (evil-undo-system 'undo-redo)
  (evil-want-C-d-scroll t)
  (evil-want-C-u-scroll t)
  (evil-search-module 'swiper)
  ; follow is required by evil-collection
  (evil-want-integration t)
  (evil-want-keybinding nil)
  :init
  (evil-mode 1)
  :config
  ; Unbind RET
  (define-key evil-motion-state-map (kbd "RET") nil)
  ; Define leader key
  (evil-set-leader nil (kbd "SPC"))
  ; Better vim keys
  (evil-define-key '(normal visual) 'global
    (kbd "C-u") (lambda () (interactive) (evil-scroll-up 0) (evil-scroll-line-to-center nil))
    (kbd "C-d") (lambda () (interactive) (evil-scroll-down 0) (evil-scroll-line-to-center nil))
  )
  ; QUICK ACTIONS ;
  (evil-define-key 'normal 'global
    (kbd "<leader> RET") 'dashboard-open
    (kbd "<leader> t") 'vterm
    (kbd "C-o") 'find-file
    (kbd "C-e") 'treemacs-select-window
    (kbd "C-i") 'lsp-ui-imenu
    (kbd "<leader> r") (lambda () (interactive)
                            (load-file "~/.config/emacs/init.el")
                            (ignore (elpaca-process-queues)))
    (kbd "<leader> c") 'comment-line
  )
  ; PROJECTILE ;
  (evil-define-key 'normal 'global
    (kbd "C-p") 'projectile-find-file
    (kbd "C-S-p") 'projectile-switch-project
    (kbd "C-S-f") 'projectile-ripgrep
  )
  ; BUFFER MANAGEMENT ;
  (which-key-add-key-based-replacements "SPC b" "Buffer Management")
  (evil-define-key 'normal 'global
    (kbd "<leader> b l") 'ibuffer
    (kbd "<leader> b i") 'switch-to-buffer
    (kbd "<leader> b j") 'next-buffer
    (kbd "<leader> b k") 'previous-buffer
    (kbd "<leader> b h") 'kill-current-buffer
  )
  ; LSP ;
  (which-key-add-key-based-replacements "SPC l" "LSP hotkeys")
  (evil-define-key 'normal 'global
    (kbd "<leader> l d") 'lsp-find-definition
    (kbd "<leader> l f") 'lsp-find-references
    (kbd "<leader> l .") 'lsp-execute-code-action
    (kbd "<leader> l r") 'lsp-rename
    (kbd "<leader> l R") 'lsp-workspace-restart
    (kbd "<leader> l k") 'lsp-ui-doc-toggle
    (kbd "<leader> l TAB") 'lsp-ui-doc-focus-frame
    (kbd "<leader> l <backtab>") 'lsp-ui-doc-unfocus-frame
  )
)
#+end_src
evil collection adds evil mode bindings to a lot more modes
#+begin_src emacs-lisp
(use-package evil-collection
  :after evil
  :ensure t
  :custom
  (evil-collection-setup-debugger-keys nil)
  (evil-collection-want-find-usages-bindings nil)
  :init
  (evil-collection-init))
#+end_src
** escape binding
makes escape quit whatever your doing just like in Vim
#+begin_src emacs-lisp
(global-set-key [escape] 'keyboard-escape-quit)
#+end_src
** return is newline (no indent)
By default, in Emacs 24.3+, these values are switched.
#+begin_src emacs-lisp
(global-set-key (kbd "RET") 'newline)
(global-set-key (kbd "C-j") 'newline-and-indent)
#+end_src
** Which Key
#+begin_src emacs-lisp
(use-package which-key
  :ensure t
  :config
  (which-key-mode)
)
#+end_src
* UI Tweaks
** Language
#+begin_src emacs-lisp
(set-locale-environment "en_US.UTF-8")
(set-language-environment "English")
(setenv "LANG" "en_US.UTF-8")
#+end_src
** Theme
As always, I use the dracula theme (the one from doom-themes looks much better)
#+begin_src emacs-lisp
(use-package dracula-theme
  :ensure t
  :config
  (load-theme 'dracula t)
)
#+end_src
** Modeline
[[https://github.com/seagle0128/doom-modeline?tab=readme-ov-file#screenshots][Doom Modeline]]
#+begin_src emacs-lisp
(use-package doom-modeline
  :ensure t
  :init
  (doom-modeline-mode 1)
  :custom
  (doom-modeline-height 25)
  (doom-modeline-hud t)
  (doom-modeline-modal-modern-icon nil)
  (doom-modeline-always-show-macro-register t)
  (doom-modeline-unicode-fallback t)
  (doom-modeline-enable-word-count t)
)
#+end_src
** Font
#+begin_src emacs-lisp
(add-to-list 'default-frame-alist '(font . "JetBrainsMono Nerd Font-11"))
(set-face-attribute 'default nil :font "JetBrainsMono Nerd Font-11")
#+end_src
