dot-config/emacs/init.el
(defvar elpaca-installer-version 0.7)
(defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
(defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
(defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
(defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                              :ref nil :depth 1
                              :files (:defaults "elpaca-test.el" (:exclude "extensions"))
                              :build (:not elpaca--activate-package)))
(let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
       (build (expand-file-name "elpaca/" elpaca-builds-directory))
       (order (cdr elpaca-order))
       (default-directory repo))
  (add-to-list 'load-path (if (file-exists-p build) build repo))
  (unless (file-exists-p repo)
    (make-directory repo t)
    (when (< emacs-major-version 28) (require 'subr-x))
    (condition-case-unless-debug err
        (if-let ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                 ((zerop (apply #'call-process `("git" nil ,buffer t "clone"
                                                 ,@(when-let ((depth (plist-get order :depth)))
                                                     (list (format "--depth=%d" depth) "--no-single-branch"))
                                                 ,(plist-get order :repo) ,repo))))
                 ((zerop (call-process "git" nil buffer t "checkout"
                                       (or (plist-get order :ref) "--"))))
                 (emacs (concat invocation-directory invocation-name))
                 ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                       "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                 ((require 'elpaca))
                 ((elpaca-generate-autoloads "elpaca" repo)))
            (progn (message "%s" (buffer-string)) (kill-buffer buffer))
          (error "%s" (with-current-buffer buffer (buffer-string))))
      ((error) (warn "%s" err) (delete-directory repo 'recursive))))
  (unless (require 'elpaca-autoloads nil t)
    (require 'elpaca)
    (elpaca-generate-autoloads "elpaca" repo)
    (load "./elpaca-autoloads")))
(add-hook 'after-init-hook #'elpaca-process-queues)
(elpaca `(,@elpaca-order))

;; Install use-package support
(elpaca elpaca-use-package
  ;; Enable use-package :ensure support for Elpaca.
  (elpaca-use-package-mode))

;; Block until current queue processed.
(elpaca-wait)

(use-package evil
  :after which-key
  :ensure t
  :custom
  (evil-undo-system 'undo-redo)
  (evil-want-C-d-scroll t)
  (evil-want-C-u-scroll t)
  (evil-search-module 'swiper)
  ; follow is required by evil-collection
  (evil-want-integration t)
  (evil-want-keybinding nil)
  :init
  (evil-mode 1)
  :config
  ; Unbind RET
  (define-key evil-motion-state-map (kbd "RET") nil)
  ; Define leader key
  (evil-set-leader nil (kbd "SPC"))
  ; Better vim keys
  (evil-define-key '(normal visual) 'global
    (kbd "C-u") (lambda () (interactive) (evil-scroll-up 0) (evil-scroll-line-to-center nil))
    (kbd "C-d") (lambda () (interactive) (evil-scroll-down 0) (evil-scroll-line-to-center nil))
  )
  ; QUICK ACTIONS ;
  (evil-define-key 'normal 'global
    (kbd "<leader> RET") 'dashboard-open
    (kbd "<leader> t") 'vterm
    (kbd "C-o") 'find-file
    (kbd "C-e") 'treemacs-select-window
    (kbd "C-i") 'lsp-ui-imenu
    (kbd "<leader> r") (lambda () (interactive)
                            (load-file "~/.config/emacs/init.el")
                            (ignore (elpaca-process-queues)))
    (kbd "<leader> c") 'comment-line
  )
  ; PROJECTILE ;
  (evil-define-key 'normal 'global
    (kbd "C-p") 'projectile-find-file
    (kbd "C-S-p") 'projectile-switch-project
    (kbd "C-S-f") 'projectile-ripgrep
  )
  ; BUFFER MANAGEMENT ;
  (which-key-add-key-based-replacements "SPC b" "Buffer Management")
  (evil-define-key 'normal 'global
    (kbd "<leader> b l") 'ibuffer
    (kbd "<leader> b i") 'switch-to-buffer
    (kbd "<leader> b j") 'next-buffer
    (kbd "<leader> b k") 'previous-buffer
    (kbd "<leader> b h") 'kill-current-buffer
  )
  ; LSP ;
  (which-key-add-key-based-replacements "SPC l" "LSP hotkeys")
  (evil-define-key 'normal 'global
    (kbd "<leader> l d") 'lsp-find-definition
    (kbd "<leader> l f") 'lsp-find-references
    (kbd "<leader> l .") 'lsp-execute-code-action
    (kbd "<leader> l r") 'lsp-rename
    (kbd "<leader> l R") 'lsp-workspace-restart
    (kbd "<leader> l k") 'lsp-ui-doc-toggle
    (kbd "<leader> l TAB") 'lsp-ui-doc-focus-frame
    (kbd "<leader> l <backtab>") 'lsp-ui-doc-unfocus-frame
  )
)

(use-package evil-collection
  :after evil
  :ensure t
  :custom
  (evil-collection-setup-debugger-keys nil)
  (evil-collection-want-find-usages-bindings nil)
  :init
  (evil-collection-init))

(global-set-key [escape] 'keyboard-escape-quit)

(global-set-key (kbd "RET") 'newline)
(global-set-key (kbd "C-j") 'newline-and-indent)

(use-package which-key
  :ensure t
  :config
  (which-key-mode)
)

(set-locale-environment "en_US.UTF-8")
(set-language-environment "English")
(setenv "LANG" "en_US.UTF-8")

(use-package dracula-theme
  :ensure t
  :config
  (load-theme 'dracula t)
)

(use-package doom-modeline
  :ensure t
  :init
  (doom-modeline-mode 1)
  :custom
  (doom-modeline-height 25)
  (doom-modeline-hud t)
  (doom-modeline-modal-modern-icon nil)
  (doom-modeline-always-show-macro-register t)
  (doom-modeline-unicode-fallback t)
  (doom-modeline-enable-word-count t)
)

(add-to-list 'default-frame-alist '(font . "JetBrainsMono Nerd Font-11"))
(set-face-attribute 'default nil :font "JetBrainsMono Nerd Font-11")
