dot-config/emacs/README.org
*** Ligatures
#+begin_src emacs-lisp
(use-package ligature
  :ensure t
  :config
  (ligature-set-ligatures 't '("www"))
  ;; Enable traditional ligature support in eww-mode, if the
  ;; `variable-pitch' face supports it
  (ligature-set-ligatures 'eww-mode '("ff" "fi" "ffi"))
  ;; Enable all Cascadia Code ligatures in programming modes
  (ligature-set-ligatures 'prog-mode '("|||>" "<|||" "<==>" "<!--" "####" "~~>" "***" "||=" "||>"
                                       ":::" "::=" "=:=" "===" "==>" "=!=" "=>>" "=<<" "=/=" "!=="
                                       "!!." ">=>" ">>=" ">>>" ">>-" ">->" "->>" "-->" "---" "-<<"
                                       "<~~" "<~>" "<*>" "<||" "<|>" "<$>" "<==" "<=>" "<=<" "<->"
                                       "<--" "<-<" "<<=" "<<-" "<<<" "<+>" "</>" "###" "#_(" "..<"
                                       "..." "+++" "/==" "///" "_|_" "www" "&&" "^=" "~~" "~@" "~="
                                       "~>" "~-" "**" "*>" "*/" "||" "|}" "|]" "|=" "|>" "|-" "{|"
                                       "[|" "]#" "::" ":=" ":>" ":<" "$>" "==" "=>" "!=" "!!" ">:"
                                       ">=" ">>" ">-" "-~" "-|" "->" "--" "-<" "<~" "<*" "<|" "<:"
                                       "<$" "<=" "<>" "<-" "<<" "<+" "</" "#{" "#[" "#:" "#=" "#!"
                                       "##" "#(" "#?" "#_" "%%" ".=" ".-" ".." ".?" "+>" "++" "?:"
                                       "?=" "?." "??" ";;" "/*" "/=" "/>" "//" "__" "~~" "(*" "*)"
                                       "\\\\" "://"))
  (global-ligature-mode 't)
)
#+end_src
** Icons
*** [[https://github.com/rainstormstudio/nerd-icons.el][Nerd Fonts for Emacs]]
#+begin_src emacs-lisp
(use-package nerd-icons
  :ensure t
 )
#+end_src
*** All the icons
#+begin_src emacs-lisp
(use-package all-the-icons :ensure t)

(use-package all-the-icons-dired
  :ensure t
  :hook (dired-mode . (lambda () (all-the-icons-dired-mode t))))
#+end_src
** Builtin UI Tweaks
#+begin_src emacs-lisp
(setq inhibit-startup-message t)

(scroll-bar-mode -1)
(tool-bar-mode -1)
(tooltip-mode -1)

(menu-bar-mode -1)

(setq-default vertical-scroll-bar nil)

;; Line numbers
(column-number-mode)
(setq-default display-line-numbers 'relative)

;; Disable dialogs/popup windows'
(setq use-file-dialog nil)   ;; No file dialog
(setq use-dialog-box nil)    ;; No dialog box
(setq pop-up-windows nil)    ;; No popup windows

;; remove line wrap
(setq-default truncate-lines t)

;; tab width
(setq-default tab-width 4)
#+end_src
** Transparency
#+begin_src emacs-lisp
;(set-frame-parameter nil 'alpha-background 75)
;(add-to-list 'default-frame-alist '(alpha-background . 75))
#+end_src
** Rainbow Delimiters
Makes ~(~, ~[~, and ~{~ rainbow!
#+begin_src emacs-lisp
(use-package rainbow-delimiters
  :ensure t
  :hook (prog-mode . rainbow-delimiters-mode))
#+end_src
** Rainbow Mode
Displays the color for any hex (i.e. #0000FF)
#+begin_src emacs-lisp
(use-package rainbow-mode
  :ensure t
  :hook org-mode prog-mode)
#+end_src
* Minibuffer Improvements
Various improvements to the minibuffer
** Vertico
#+begin_src emacs-lisp
(use-package vertico
  :ensure t
  :bind (:map vertico-map
          ("C-j" . vertico-next)
          ("C-k" . vertico-previous)
          ; These are backwards... interesting
          ("C-d" . vertico-scroll-up)
          ("C-u" . vertico-scroll-down)
        )
  :custom
  (vertico-cycle t)
  :init
  (vertico-mode))
#+end_src
** Orderless Completition
#+begin_src emacs-lisp
(use-package orderless
  :ensure t
  :init
  (setq completion-styles '(orderless basic emacs22))
  ; Doesn't need to be here but since I'm doing completion stuff here anyways...
  (setq orderless-smart-case nil)
  (setq completion-ignore-case t)
  (setq read-file-name-completion-ignore-case t)
  (setq read-buffer-completion-ignore-case t)
)
#+end_src
** Save history across emacs sessions
#+begin_src emacs-lisp
(use-package savehist
  :init
  (savehist-mode))
#+end_src
** Marginalia
Tooltips to the right of options in the minibuffer
#+begin_src emacs-lisp
(use-package marginalia
  :ensure t
  :init
  (marginalia-mode))
#+end_src
* Packages
** Projectile
[[https://github.com/bbatsov/projectile][Projectile Github]]
#+begin_src emacs-lisp
(use-package projectile
  :ensure t
  :config

  (projectile-mode 1))
#+end_src
*** Ripgrep support
#+begin_src emacs-lisp
(use-package ripgrep :ensure t)
#+end_src
** Dashboard
[[https://github.com/emacs-dashboard/emacs-dashboard][Emacs Dashboard]]
#+begin_src emacs-lisp
(use-package dashboard
  :ensure t
  :requires (nerd-icons projectile)
  :hook (dashboard-mode . (lambda () (setq display-line-numbers nil)))
  :custom
  (dashboard-banner-logo-title nil)
  (dashboard-startup-banner "~/.config/emacs/logo.txt")
  (dashboard-display-icons-p t)
  (dashboard-center-content t)
  (dashboard-icon-type 'nerd-icons)
  (dashboard-set-heading-icons t)
  (dashboard-set-file-icons t)
  (dashboard-projects-backend 'projectile)
  (dashboard-items '((projects . 10)
                     (recents  . 10)))
  :config
  (dashboard-setup-startup-hook))
#+end_src
Auto open dashboard
#+begin_src emacs-lisp
(setq initial-buffer-choice (lambda () (get-buffer-create dashboard-buffer-name)))
#+end_src
** Org Mode
#+begin_src emacs-lisp
(use-package org
  :after evil
  :ensure t
  :custom
  (org-hide-emphasis-markers t)
  (org-startup-indented t)
  (org-startup-with-latex-preview t)
  (org-startup-with-inline-images t)
  (org-image-actual-width '(0.5))
  (org-edit-src-content-indentation 0)
  (org-hide-leading-stars t)
  (org-return-follows-link t)
  :config
  (custom-set-faces
    '(org-level-1 ((t (:inherit outline-1 :height 1.5))))
    '(org-level-2 ((t (:inherit outline-2 :height 1.3))))
    '(org-level-3 ((t (:inherit outline-3 :height 1.1))))
    '(org-level-4 ((t (:inherit outline-4 :height 1.0))))
    '(org-level-5 ((t (:inherit outline-5 :height 1.0))))
  )
  (evil-define-key 'normal 'org-mode-map (kbd "<leader> i") 'org-edit-special)
)
#+end_src
*** Org Superstar
~org-superstar~ handles the nice rendering of bullets in headers and lists
#+begin_src emacs-lisp
(use-package org-superstar
  :ensure t
  :after org
  :hook (org-mode . (lambda () (org-superstar-mode 1)))
  :config
  (setq org-superstar-leading-bullet "  ")
  (setq org-superstar-special-todo-items t))
#+end_src
*** Latex Formating
#+begin_src emacs-lisp
(setq org-format-latex-options
  '(:foreground default
    :background "Transparent"
    :scale 0.75
    :html-foreground "Black"
    :html-background "Transparent"
    :html-scale 1.0
    :matchers ("begin" "$1" "$" "$$" "\\(" "\\[")))
(add-hook 'org-mode-hook
  (lambda ()
      (add-hook 'after-save-hook 'org-latex-preview nil 'make-local)))
#+end_src
*** Speedy Latex
#+begin_src emacs-lisp
(use-package auctex :ensure t)
(use-package cdlatex
  :after org auctex
  :ensure t
  :config
  (add-hook 'org-mode-hook #'turn-on-org-cdlatex)
)
#+end_src
*** Auto image rendering
#+begin_src emacs-lisp
(add-hook 'org-mode-hook
  (lambda ()
      (add-hook 'after-save-hook (lambda () (org-display-inline-images)))))
#+end_src
*** Auto Tangleing
Automatically tangles my org files
#+begin_src emacs-lisp
(add-hook 'org-mode-hook
    (lambda ()
        (add-hook 'after-save-hook #'org-babel-tangle
                nil 'make-it-local)))
#+end_src
*** TOC Org
Allows for table of contents in org files
#+begin_src emacs-lisp
(use-package toc-org
  :ensure t
  :after org
  :hook (org-mode . toc-org-mode)
  :custom
  (toc-org-max-depth 3) ; default 2
)
#+end_src
