dot-config/emacs/init.el

(use-package treemacs
  :ensure t
  :defer t
  :init
  (with-eval-after-load 'winum
    (define-key winum-keymap (kbd "M-0") #'treemacs-select-window))
  :config
  (progn
    (setq treemacs-collapse-dirs                   (if treemacs-python-executable 3 0)
          treemacs-deferred-git-apply-delay        0.5
          treemacs-directory-name-transformer      #'identity
          treemacs-display-in-side-window          t
          treemacs-eldoc-display                   'simple
          treemacs-file-event-delay                2000
          treemacs-file-extension-regex            treemacs-last-period-regex-value
          treemacs-file-follow-delay               0.2
          treemacs-file-name-transformer           #'identity
          treemacs-follow-after-init               t
          treemacs-expand-after-init               t
          treemacs-find-workspace-method           'find-for-file-or-pick-first
          treemacs-git-command-pipe                ""
          treemacs-goto-tag-strategy               'refetch-index
          treemacs-header-scroll-indicators        '(nil . "^^^^^^")
          treemacs-hide-dot-git-directory          t
          treemacs-indentation                     2
          treemacs-indentation-string              " "
          treemacs-is-never-other-window           nil
          treemacs-max-git-entries                 5000
          treemacs-missing-project-action          'ask
          treemacs-move-forward-on-expand          nil
          treemacs-no-png-images                   nil
          treemacs-no-delete-other-windows         t
          treemacs-project-follow-cleanup          nil
          treemacs-persist-file                    (expand-file-name ".cache/treemacs-persist" user-emacs-directory)
          treemacs-position                        'right
          treemacs-read-string-input               'from-child-frame
          treemacs-recenter-distance               0.1
          treemacs-recenter-after-file-follow      nil
          treemacs-recenter-after-tag-follow       nil
          treemacs-recenter-after-project-jump     'always
          treemacs-recenter-after-project-expand   'on-distance
          treemacs-litter-directories              '("/node_modules" "/.venv" "/.cask")
          treemacs-project-follow-into-home        nil
          treemacs-show-cursor                     nil
          treemacs-show-hidden-files               t
          treemacs-silent-filewatch                nil
          treemacs-silent-refresh                  nil
          treemacs-sorting                         'alphabetic-asc
          treemacs-select-when-already-in-treemacs 'move-back
          treemacs-space-between-root-nodes        t
          treemacs-tag-follow-cleanup              t
          treemacs-tag-follow-delay                1.5
          treemacs-text-scale                      nil
          treemacs-user-mode-line-format           nil
          treemacs-user-header-line-format         nil
          treemacs-wide-toggle-width               70
          treemacs-width                           35
          treemacs-width-increment                 1
          treemacs-width-is-initially-locked       t
          treemacs-workspace-switch-cleanup        nil)

    ;; The default width and height of the icons is 22 pixels. If you are
    ;; using a Hi-DPI display, uncomment this to double the icon size.
    ;;(treemacs-resize-icons 44)

    (treemacs-follow-mode t)
    (treemacs-filewatch-mode t)
    (treemacs-fringe-indicator-mode 'always)
    (when treemacs-python-executable
      (treemacs-git-commit-diff-mode t))

    (pcase (cons (not (null (executable-find "git")))
                 (not (null treemacs-python-executable)))
      (`(t . t)
       (treemacs-git-mode 'deferred))
      (`(t . _)
       (treemacs-git-mode 'simple)))

    (treemacs-hide-gitignored-files-mode nil)))

(use-package treemacs-evil
  :after (treemacs evil)
  :ensure t)

(use-package treemacs-projectile
  :after (treemacs projectile)
  :ensure t)

(use-package treemacs-icons-dired
  :hook (dired-mode . treemacs-icons-dired-enable-once)
  :ensure t)

(use-package treemacs-magit
  :after (treemacs magit)
  :ensure t)

(use-package evil-anzu
  :ensure t
  :after (evil)
)
(use-package anzu
  :ensure t
  :config
  (global-anzu-mode +1)
)

(use-package flycheck
  :ensure t
  :config
  (global-flycheck-mode)
)

(use-package company
  :ensure t
  :config
  (setq company-minimum-prefix-length 1)
  (push 'company-yasnippet company-backends)
  (company-mode)
)

(require 'treesit)
(customize-set-variable 'treesit-font-lock-level 4)

(use-package treesit-auto
  :ensure t
  :config
  (treesit-auto-add-to-auto-mode-alist 'all)
  (global-treesit-auto-mode))

(use-package markdown-mode :ensure t)

(use-package lsp-mode
  :ensure t
  :hook (
    (css-ts-mode . lsp)
    (typescript-ts-mode . lsp)
  )
  :commands lsp
)

(use-package lsp-ui
  :ensure t
  :hook (lsp-ui-doc-frame-mode . (lambda () (setq display-line-numbers nil)))
  :custom
  (lsp-ui-doc-position 'at-point)
  :config
  (add-to-list 'lsp-ui-doc-frame-parameters '(alpha-background . 100))
)

(use-package web-mode
  :ensure t
  :hook (
    (html-mode . web-mode)
    (mhtml-mode . web-mode)
    (web-mode . lsp)
  )
  :init
  (add-to-list 'auto-mode-alist '("\\.vue\\'" . web-mode))
  (setf (alist-get 'web-mode lsp--formatting-indent-alist) 'web-mode-code-indent-offset)
)

(defun vue-on-save ()
  "Run a CLI command on .vue files before saving, in the file's directory."
  (interactive)
  (when (or (string-match-p "\\.vue" buffer-file-name) (string-match-p "\\.ts" buffer-file-name) (string-match-p "\\.js" buffer-file-name))
    (cd (projectile-project-root))
    (start-process "vue-on-save" "*vue-on-save*" "node" "./node_modules/.bin/eslint" (shell-quote-argument buffer-file-name) "--fix")))

(add-hook 'after-save-hook 'vue-on-save)

(use-package lsp-pyright
  :ensure t
  :hook
  (python-ts-mode . (lambda () (lsp)))
  :init
  (setq lsp-pyright-multi-root nil)
)

(use-package pyenv-mode
  :ensure t
  :config
  (setq exec-path (append exec-path '("~/.pyenv/bin")))
  (pyenv-mode)
)

(defun python-on-save ()
  "Run a CLI command on .py files before saving, in the file's directory."
  (interactive)
  (when (string-match-p "\\.py\\'" buffer-file-name)
    (cd (file-name-directory buffer-file-name))
    (start-process-shell-command "python-on-save" "*python-on-save*" (concat ". ~/.local/bin/lazy-pyenv; isort -l 240 " buffer-file-name "; black " buffer-file-name))))

(add-hook 'after-save-hook 'python-on-save)

(use-package lsp-java
  :ensure t
  :hook (java-ts-mode . lsp)
)

(use-package haskell-mode
  :ensure t
)

(setq lsp-go-analyses '((shadow . t)
                        (simplifycompositelit . :json-false)))

(add-hook 'go-ts-mode-hook 'lsp)

(setq-default go-ts-mode-indent-offset 4)

(defun go-on-save ()
  "Run a CLI command on .go files before saving, in the file's directory."
  (interactive)
  (when (string-match-p "\\.go\\'" buffer-file-name)
    (cd (file-name-directory buffer-file-name))
    (start-process-shell-command "go-on-save" "*go-on-save*" "go fmt .")))

(add-hook 'after-save-hook 'go-on-save)
