dot-config/emacs/README.org
** Move Backup Files
#+begin_src emacs-lisp
(setq backup-directory-alist '(("." . "~/.config/emacs/backup"))
      backup-by-copying      t  ; Don't de-link hard links
      version-control        t  ; Use version numbers on backups
      delete-old-versions    t  ; Automatically delete excess backups:
      kept-new-versions      20 ; how many of the newest versions to keep
      kept-old-versions      2) ; and how many of the old
#+end_src
** Move Custom File
#+begin_src emacs-lisp
(setq custom-file "~/.config/emacs/emacs-custom.el")
(ignore-errors (load custom-file))
#+end_src
** Enable Folding
#+begin_src emacs-lisp
(add-hook 'prog-mode-hook 'outline-minor-mode)
#+end_src
** Auto Revert
#+begin_src emacs-lisp
(global-auto-revert-mode)
#+end_src
** Spaces over tabs
#+begin_src emacs-lisp
(setq-default indent-tabs-mode nil)
#+end_src
** Stuff on save
On save, we want to:
- Format whitespace

#+begin_src emacs-lisp
(add-hook 'before-save-hook
    (lambda ()
        (whitespace-cleanup)
    )
)
#+end_src
