dot-config/emacs/init.el

(setq backup-directory-alist '(("." . "~/.config/emacs/backup"))
      backup-by-copying      t  ; Don't de-link hard links
      version-control        t  ; Use version numbers on backups
      delete-old-versions    t  ; Automatically delete excess backups:
      kept-new-versions      20 ; how many of the newest versions to keep
      kept-old-versions      2) ; and how many of the old

(setq custom-file "~/.config/emacs/emacs-custom.el")
(ignore-errors (load custom-file))

(add-hook 'prog-mode-hook 'outline-minor-mode)

(global-auto-revert-mode)

(setq-default indent-tabs-mode nil)

(add-hook 'before-save-hook
    (lambda ()
        (whitespace-cleanup)
    )
)
